# Basic Pandas Library

Pandas is a Python library used for working with data sets.
It has functions for analyzing, cleaning, exploring, and manipulating data.

why we use pandas?
Pandas allows us to analyze big data and make conclusions based on statistical theories.

Pandas can clean messy data sets, and make them readable and relevant.

Pandas are also able to delete rows that are not relevant, or contains wrong values, like empty or NULL values. 
This is called cleaning the data.

Pandas library:Data manipulation,cleaning,Transformation,visualization --> EDA(Exploratory data analysis)

# series

A Pandas Series is like a column in a table.It is a one-dimensional array holding data of any type.

In [1]:
import pandas as pd

In [2]:
s = [20,25,26,27,28,29,30]

In [3]:
ser = pd.Series(s)

In [4]:
ser

0    20
1    25
2    26
3    27
4    28
5    29
6    30
dtype: int64

In [40]:
ser[0]

20

In [41]:
ser = pd.Series(s,name = 'age')

In [42]:
ser

0    20
1    25
2    26
3    27
4    28
5    29
6    30
Name: age, dtype: int64

In [43]:
type(ser)

pandas.core.series.Series

In [5]:
ser = pd.Series(s,name = 'age',index = ['a','b','c','d','e','f','g'],dtype = 'int32')

In [6]:
ser

a    20
b    25
c    26
d    27
e    28
f    29
g    30
Name: age, dtype: int32

In [46]:
ser = pd.Series(s,name = 'age',index = ['a','b','c','d','e','f','g'],dtype = 'float32')

In [47]:
ser

a    20.0
b    25.0
c    26.0
d    27.0
e    28.0
f    29.0
g    30.0
Name: age, dtype: float32

In [53]:
ser = pd.Series(s,name = 'age',index = ['a','b','c','d','e','f','g'],dtype = 'int64')

In [54]:
ser

a    20
b    25
c    26
d    27
e    28
f    29
g    30
Name: age, dtype: int64

In [55]:
weight = [50,40,60,70,80,90,5070]
weight_ser = pd.Series(weight,name = 'weight',index = ['a','b','c','d','e','f','g'])

In [56]:
weight_ser

a      50
b      40
c      60
d      70
e      80
f      90
g    5070
Name: weight, dtype: int64

In [57]:
ser + weight_ser

a      70
b      65
c      86
d      97
e     108
f     119
g    5100
dtype: int64

In [58]:
ser/weight_ser

a    0.400000
b    0.625000
c    0.433333
d    0.385714
e    0.350000
f    0.322222
g    0.005917
dtype: float64

In [59]:
ser*weight_ser

a      1000
b      1000
c      1560
d      1890
e      2240
f      2610
g    152100
dtype: int64

In [60]:
ser^weight_ser

a      38
b      49
c      38
d      93
e      76
f      71
g    5072
dtype: int64

In [63]:
sign = -weight_ser

In [64]:
sign < 0

a    True
b    True
c    True
d    True
e    True
f    True
g    True
Name: weight, dtype: bool

In [66]:
ser.sum() > 200

False

In [67]:
ser.mean()

26.428571428571427

In [68]:
round(ser.mean(),2)

26.43

In [69]:
ser.median()

27.0

In [70]:
ser.mode()

0    20
1    25
2    26
3    27
4    28
5    29
6    30
Name: age, dtype: int64

In [72]:
ser.mean()==ser.median()==ser.mode()

False

In [73]:
ser.mode()

0    20
1    25
2    26
3    27
4    28
5    29
6    30
Name: age, dtype: int64

In [74]:
ser[1]=20

In [75]:
ser

a    20
b    20
c    26
d    27
e    28
f    29
g    30
Name: age, dtype: int64

In [76]:
ser.mode()

0    20
Name: age, dtype: int64

In [77]:
ser.count()

7

In [78]:
ser.corr(weight_ser)

0.4671194540911579

In [79]:
ser.astype(dtype = 'str')

a    20
b    20
c    26
d    27
e    28
f    29
g    30
Name: age, dtype: object

In [80]:
ser.cumsum()

a     20
b     40
c     66
d     93
e    121
f    150
g    180
Name: age, dtype: int64

In [81]:
ser.cumprod()

a            20
b           400
c         10400
d        280800
e       7862400
f     228009600
g    6840288000
Name: age, dtype: int64

In [82]:
ser.cummax()

a    20
b    20
c    26
d    27
e    28
f    29
g    30
Name: age, dtype: int64

In [83]:
ser.max()

30

# DataFrame

Data sets in Pandas are usually multi-dimensional tables, called DataFrames.Series is like a column, a DataFrame is the whole table.

A Pandas DataFrame is a 2 dimensional data structure, like a 2 dimensional array, or a table with rows and columns.

In [49]:


data = {
        "Name": [
            "Braund, Mr. Owen Harris",
            "Allen, Mr. William Henry",
            "Bonnell, Miss. Elizabeth",
             "rajesh, Mr. Owen Harris",
            "Anish, Mr. William Henry",
            "asif, Miss. Elizabeth",
        ],
        "Age": [22, 35, 58,50,70,30],
        "Sex": ["male", "male", "female","male","male","female"],
        "education":["BE","Btech","MBBS","BE","MBA","MBA"]    }

In [50]:
data

{'Name': ['Braund, Mr. Owen Harris',
  'Allen, Mr. William Henry',
  'Bonnell, Miss. Elizabeth',
  'rajesh, Mr. Owen Harris',
  'Anish, Mr. William Henry',
  'asif, Miss. Elizabeth'],
 'Age': [22, 35, 58, 50, 70, 30],
 'Sex': ['male', 'male', 'female', 'male', 'male', 'female'],
 'education': ['BE', 'Btech', 'MBBS', 'BE', 'MBA', 'MBA']}

In [51]:
df = pd.DataFrame(data)

In [52]:
df

                       Name  Age     Sex education
0   Braund, Mr. Owen Harris   22    male        BE
1  Allen, Mr. William Henry   35    male     Btech
2  Bonnell, Miss. Elizabeth   58  female      MBBS
3   rajesh, Mr. Owen Harris   50    male        BE
4  Anish, Mr. William Henry   70    male       MBA
5     asif, Miss. Elizabeth   30  female       MBA

In [16]:
df.dtypes

Name         object
Age           int64
Sex          object
education    object
dtype: object

In [17]:
df['Name']

0     Braund, Mr. Owen Harris
1    Allen, Mr. William Henry
2    Bonnell, Miss. Elizabeth
3     rajesh, Mr. Owen Harris
4    Anish, Mr. William Henry
5       asif, Miss. Elizabeth
Name: Name, dtype: object

In [18]:
df_name = df['Name']

In [19]:
type(df_name)                    #single column is considered as series

pandas.core.series.Series

In [20]:
df.rename(columns={'Name':'Student_name','Sex':'Gender'},inplace = True)
print(df)

               Student_name  Age  Gender education
0   Braund, Mr. Owen Harris   22    male        BE
1  Allen, Mr. William Henry   35    male     Btech
2  Bonnell, Miss. Elizabeth   58  female      MBBS
3   rajesh, Mr. Owen Harris   50    male        BE
4  Anish, Mr. William Henry   70    male       MBA
5     asif, Miss. Elizabeth   30  female       MBA

In [21]:
df[['Student_name','Age']]

               Student_name  Age
0   Braund, Mr. Owen Harris   22
1  Allen, Mr. William Henry   35
2  Bonnell, Miss. Elizabeth   58
3   rajesh, Mr. Owen Harris   50
4  Anish, Mr. William Henry   70
5     asif, Miss. Elizabeth   30

In [22]:
df[df['Age']>30]

               Student_name  Age  Gender education
1  Allen, Mr. William Henry   35    male     Btech
2  Bonnell, Miss. Elizabeth   58  female      MBBS
3   rajesh, Mr. Owen Harris   50    male        BE
4  Anish, Mr. William Henry   70    male       MBA

In [23]:
df[df['Gender']=='male']

               Student_name  Age Gender education
0   Braund, Mr. Owen Harris   22   male        BE
1  Allen, Mr. William Henry   35   male     Btech
3   rajesh, Mr. Owen Harris   50   male        BE
4  Anish, Mr. William Henry   70   male       MBA

In [24]:
df1 = df[df['Gender']=='male']

df2 = df1[df1['Age']>30]

In [25]:
df1

               Student_name  Age Gender education
0   Braund, Mr. Owen Harris   22   male        BE
1  Allen, Mr. William Henry   35   male     Btech
3   rajesh, Mr. Owen Harris   50   male        BE
4  Anish, Mr. William Henry   70   male       MBA

In [27]:
df.value_counts()

Student_name              Age  Gender  education
Allen, Mr. William Henry  35   male    Btech        1
Anish, Mr. William Henry  70   male    MBA          1
Bonnell, Miss. Elizabeth  58   female  MBBS         1
Braund, Mr. Owen Harris   22   male    BE           1
asif, Miss. Elizabeth     30   female  MBA          1
rajesh, Mr. Owen Harris   50   male    BE           1
dtype: int64

In [29]:
df['Gender'].value_counts()

male      4
female    2
Name: Gender, dtype: int64

In [30]:
df['education'].value_counts()

BE       2
MBA      2
Btech    1
MBBS     1
Name: education, dtype: int64

isnull() is a method of Pandas Series objects, while isna() is a method of both Series and DataFrame objects.

In [32]:
df.isnull()

   Student_name    Age  Gender  education
0         False  False   False      False
1         False  False   False      False
2         False  False   False      False
3         False  False   False      False
4         False  False   False      False
5         False  False   False      False

In [33]:
df.isna()

   Student_name    Age  Gender  education
0         False  False   False      False
1         False  False   False      False
2         False  False   False      False
3         False  False   False      False
4         False  False   False      False
5         False  False   False      False

In [34]:
df.isna().sum()

Student_name    0
Age             0
Gender          0
education       0
dtype: int64

In [35]:
df.isnull().sum()

Student_name    0
Age             0
Gender          0
education       0
dtype: int64

In [36]:
df = pd.DataFrame(data,columns = ['Student','Age'])

In [37]:
df               # a missing value is denoted by NaN .

  Student  Age
0     NaN   22
1     NaN   35
2     NaN   58
3     NaN   50
4     NaN   70
5     NaN   30

In [38]:
df.isna().sum()

Student    6
Age        0
dtype: int64

In [39]:
df.isnull().sum()

Student    6
Age        0
dtype: int64

In [56]:
df.loc[0:4 , ['Name','Age']]    #loc -> location    #loc is typically used for label indexing and can access multiple columns

                       Name  Age
0   Braund, Mr. Owen Harris   22
1  Allen, Mr. William Henry   35
2  Bonnell, Miss. Elizabeth   58
3   rajesh, Mr. Owen Harris   50
4  Anish, Mr. William Henry   70

In [42]:
df.iloc[0:4,0:2]          #iloc -> index location      # iloc is used for integer indexing.

  Student  Age
0     NaN   22
1     NaN   35
2     NaN   58
3     NaN   50

In [53]:
df.drop(5)

                       Name  Age     Sex education
0   Braund, Mr. Owen Harris   22    male        BE
1  Allen, Mr. William Henry   35    male     Btech
2  Bonnell, Miss. Elizabeth   58  female      MBBS
3   rajesh, Mr. Owen Harris   50    male        BE
4  Anish, Mr. William Henry   70    male       MBA

In [54]:
df.drop_duplicates()

                       Name  Age     Sex education
0   Braund, Mr. Owen Harris   22    male        BE
1  Allen, Mr. William Henry   35    male     Btech
2  Bonnell, Miss. Elizabeth   58  female      MBBS
3   rajesh, Mr. Owen Harris   50    male        BE
4  Anish, Mr. William Henry   70    male       MBA
5     asif, Miss. Elizabeth   30  female       MBA

In [55]:
df.dropna()             # if there is na value it should be drop

                       Name  Age     Sex education
0   Braund, Mr. Owen Harris   22    male        BE
1  Allen, Mr. William Henry   35    male     Btech
2  Bonnell, Miss. Elizabeth   58  female      MBBS
3   rajesh, Mr. Owen Harris   50    male        BE
4  Anish, Mr. William Henry   70    male       MBA
5     asif, Miss. Elizabeth   30  female       MBA

# analysis using pandas

In [18]:
#Reading data
import pandas as pd
salaries_df = pd.read_csv(r"C:\Users\Anish\Downloads\Salaries.csv")

In [19]:
salaries_df

         rank discipline  phd  service     sex  salary
0        Prof          B   56       49    Male  186960
1        Prof          A   12        6    Male   93000
2        Prof          A   23       20    Male  110515
3        Prof          A   40       31    Male  131205
4        Prof          B   20       18    Male  104800
..        ...        ...  ...      ...     ...     ...
73       Prof          B   18       10  Female  105450
74  AssocProf          B   19        6  Female  104542
75       Prof          B   17       17  Female  124312
76       Prof          A   28       14  Female  109954
77       Prof          A   23       15  Female  109646

[78 rows x 6 columns]

In [60]:
salaries_df.columns

Index(['rank', 'discipline', 'phd', 'service', 'sex', 'salary'], dtype='object')

In [10]:
# first values -> head / last values -> tail

salaries_df.head()

   rank discipline  phd  service   sex  salary
0  Prof          B   56       49  Male  186960
1  Prof          A   12        6  Male   93000
2  Prof          A   23       20  Male  110515
3  Prof          A   40       31  Male  131205
4  Prof          B   20       18  Male  104800

In [61]:
salaries_df.head(10)

        rank discipline  phd  service   sex  salary
0       Prof          B   56       49  Male  186960
1       Prof          A   12        6  Male   93000
2       Prof          A   23       20  Male  110515
3       Prof          A   40       31  Male  131205
4       Prof          B   20       18  Male  104800
5       Prof          A   20       20  Male  122400
6  AssocProf          A   20       17  Male   81285
7       Prof          A   18       18  Male  126300
8       Prof          A   29       19  Male   94350
9       Prof          A   51       51  Male   57800

In [13]:
salaries_df.tail()

         rank discipline  phd  service     sex  salary
73       Prof          B   18       10  Female  105450
74  AssocProf          B   19        6  Female  104542
75       Prof          B   17       17  Female  124312
76       Prof          A   28       14  Female  109954
77       Prof          A   23       15  Female  109646

In [62]:
#Inforamtion about data:
salaries_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 78 entries, 0 to 77
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   rank        78 non-null     object
 1   discipline  78 non-null     object
 2   phd         78 non-null     int64
 3   service     78 non-null     int64
 4   sex         78 non-null     object
 5   salary      78 non-null     int64
dtypes: int64(3), object(3)
memory usage: 3.8+ KB

In [12]:
#summary statistics

salaries_df.describe()           #only the int related data is going to describe

             phd    service         salary
count  78.000000  78.000000      78.000000
mean   19.705128  15.051282  108023.782051
std    12.498425  12.139768   28293.661022
min     1.000000   0.000000   57800.000000
25%    10.250000   5.250000   88612.500000
50%    18.500000  14.500000  104671.000000
75%    27.750000  20.750000  126774.750000
max    56.000000  51.000000  186960.000000

In [16]:
salaries_df['phd'].mean()

19.705128205128204

In [17]:
salaries_df['phd'].median()

18.5

In [18]:
salaries_df['phd'].mode()

0    4
Name: phd, dtype: int64

In [20]:
salaries_df['rank'].mode()

0    Prof
Name: rank, dtype: object

In [21]:
#value counts

salaries_df['rank'].value_counts()

Prof         46
AsstProf     19
AssocProf    13
Name: rank, dtype: int64

In [22]:
salaries_df['discipline'].value_counts()

B    42
A    36
Name: discipline, dtype: int64

In [23]:
salaries_df['sex'].value_counts()

Male      39
Female    39
Name: sex, dtype: int64

In [32]:
# average salary on ranking
salaries_df.loc[[0,10,3,6]]['salary']

0     186960
10    128250
3     131205
6      81285
Name: salary, dtype: int64

In [35]:
salaries_df.loc[0:10]

         rank discipline  phd  service   sex  salary
0        Prof          B   56       49  Male  186960
1        Prof          A   12        6  Male   93000
2        Prof          A   23       20  Male  110515
3        Prof          A   40       31  Male  131205
4        Prof          B   20       18  Male  104800
5        Prof          A   20       20  Male  122400
6   AssocProf          A   20       17  Male   81285
7        Prof          A   18       18  Male  126300
8        Prof          A   29       19  Male   94350
9        Prof          A   51       51  Male   57800
10       Prof          B   39       33  Male  128250

In [31]:
salaries_df.iloc[[0,10]]['salary']

0     186960
10    128250
Name: salary, dtype: int64

In [40]:
df_discipline = salaries_df.iloc[0:][['discipline']].mode()

In [41]:
df_discipline

  discipline
0          B

In [42]:
df_salary = salaries_df.iloc[0:][['salary']].mean()

In [43]:
df_salary

salary    108023.782051
dtype: float64

In [44]:
salaries_df.loc[0:,['rank','salary']]

         rank  salary
0        Prof  186960
1        Prof   93000
2        Prof  110515
3        Prof  131205
4        Prof  104800
..        ...     ...
73       Prof  105450
74  AssocProf  104542
75       Prof  124312
76       Prof  109954
77       Prof  109646

[78 rows x 2 columns]

In [45]:
salaries_df.loc[:,['rank','salary','discipline']]         # loc[row indexer,[column names]]

         rank  salary discipline
0        Prof  186960          B
1        Prof   93000          A
2        Prof  110515          A
3        Prof  131205          A
4        Prof  104800          B
..        ...     ...        ...
73       Prof  105450          B
74  AssocProf  104542          B
75       Prof  124312          B
76       Prof  109954          A
77       Prof  109646          A

[78 rows x 3 columns]

In [46]:
salaries_df.columns

Index(['rank', 'discipline', 'phd', 'service', 'sex', 'salary'], dtype='object')

In [48]:
salaries_df.iloc[0:10,0:4]

        rank discipline  phd  service
0       Prof          B   56       49
1       Prof          A   12        6
2       Prof          A   23       20
3       Prof          A   40       31
4       Prof          B   20       18
5       Prof          A   20       20
6  AssocProf          A   20       17
7       Prof          A   18       18
8       Prof          A   29       19
9       Prof          A   51       51

In [49]:
salaries_df.iloc[0:10,0]

0         Prof
1         Prof
2         Prof
3         Prof
4         Prof
5         Prof
6    AssocProf
7         Prof
8         Prof
9         Prof
Name: rank, dtype: object

In [50]:
salaries_df.iloc[0:10,1]

0    B
1    A
2    A
3    A
4    B
5    A
6    A
7    A
8    A
9    A
Name: discipline, dtype: object

In [51]:
salaries_df.iloc[:,[5]].mean()

salary    108023.782051
dtype: float64

In [63]:
salaries_df[((salaries_df['salary'] > 108023) & (salaries_df['rank'] == 'Prof' ))]          #When you use and , you are comparing boolean values, but when you use & you are element-wising logical and.

    rank discipline  phd  service     sex  salary
0   Prof          B   56       49    Male  186960
2   Prof          A   23       20    Male  110515
3   Prof          A   40       31    Male  131205
5   Prof          A   20       20    Male  122400
7   Prof          A   18       18    Male  126300
10  Prof          B   39       33    Male  128250
11  Prof          B   23       23    Male  134778
13  Prof          B   35       33    Male  162200
14  Prof          B   25       19    Male  153750
15  Prof          B   17        3    Male  150480
19  Prof          A   29       27    Male  150500
26  Prof          A   38       19    Male  148750
27  Prof          A   45       43    Male  155865
29  Prof          B   21       20    Male  123683
31  Prof          B   22       21    Male  155750
33  Prof          B   18       18    Male  120000
35  Prof          B   28       23    Male  126933
36  Prof          B   45       45    Male  146856
39  Prof          B   18       18  Female  129000
40  Prof          A   39       36  Female  137000
44  Prof          B   23       19  Female  151768
45  Prof          B   25       25  Female  140096
48  Prof          B   17       17  Female  111512
49  Prof          B   17       18  Female  122960
51  Prof          B   20       14  Female  127512
58  Prof          B   36       26  Female  144651
65  Prof          A   36       19  Female  117555
69  Prof          A   28        7  Female  116450
72  Prof          B   24       15  Female  161101
75  Prof          B   17       17  Female  124312
76  Prof          A   28       14  Female  109954
77  Prof          A   23       15  Female  109646

In [56]:
cars_df = pd.read_csv(r"C:\Users\Anish\Downloads\mtcars.csv")

In [92]:
cars_df

     mpg  cyl   disp   hp  drat     wt   qsec  vs  am  gear  carb
0   21.0    6  160.0  110  3.90  2.620  16.46   0   1     4     4
1   21.0    6  160.0  110  3.90  2.875  17.02   0   1     4     4
2   22.8    4  108.0   93  3.85  2.320  18.61   1   1     4     1
3   21.4    6  258.0  110  3.08  3.215  19.44   1   0     3     1
4   18.7    8  360.0  175  3.15  3.440  17.02   0   0     3     2
5   18.1    6  225.0  105  2.76  3.460  20.22   1   0     3     1
6   14.3    8  360.0  245  3.21  3.570  15.84   0   0     3     4
7   24.4    4  146.7   62  3.69  3.190  20.00   1   0     4     2
8   22.8    4  140.8   95  3.92  3.150  22.90   1   0     4     2
9   19.2    6  167.6  123  3.92  3.440  18.30   1   0     4     4
10  17.8    6  167.6  123  3.92  3.440  18.90   1   0     4     4
11  16.4    8  275.8  180  3.07  4.070  17.40   0   0     3     3
12  17.3    8  275.8  180  3.07  3.730  17.60   0   0     3     3
13  15.2    8  275.8  180  3.07  3.780  18.00   0   0     3     3
14  10.4    8  472.0  205  2.93  5.250  17.98   0   0     3     4
15  10.4    8  460.0  215  3.00  5.424  17.82   0   0     3     4
16  14.7    8  440.0  230  3.23  5.345  17.42   0   0     3     4
17  32.4    4   78.7   66  4.08  2.200  19.47   1   1     4     1
18  30.4    4   75.7   52  4.93  1.615  18.52   1   1     4     2
19  33.9    4   71.1   65  4.22  1.835  19.90   1   1     4     1
20  21.5    4  120.1   97  3.70  2.465  20.01   1   0     3     1
21  15.5    8  318.0  150  2.76  3.520  16.87   0   0     3     2
22  15.2    8  304.0  150  3.15  3.435  17.30   0   0     3     2
23  13.3    8  350.0  245  3.73  3.840  15.41   0   0     3     4
24  19.2    8  400.0  175  3.08  3.845  17.05   0   0     3     2
25  27.3    4   79.0   66  4.08  1.935  18.90   1   1     4     1
26  26.0    4  120.3   91  4.43  2.140  16.70   0   1     5     2
27  30.4    4   95.1  113  3.77  1.513  16.90   1   1     5     2
28  15.8    8  351.0  264  4.22  3.170  14.50   0   1     5     4
29  19.7    6  145.0  175  3.62  2.770  15.50   0   1     5     6
30  15.0    8  301.0  335  3.54  3.570  14.60   0   1     5     8
31  21.4    4  121.0  109  4.11  2.780  18.60   1   1     4     2

In [6]:
import pandas as pd
train_df = pd.read_csv(r"C:\Users\Anish\Downloads\train.csv")

In [7]:
train_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [70]:
train_df['Age'].mean()

29.69911764705882

In [64]:
train_df['Age'].isnull().sum()

177

In [65]:
train_df['Cabin'].isnull().sum()

687

In [66]:
train_df['Embarked'].isnull().sum()

2

In [67]:
train_df.duplicated()

0      False
1      False
2      False
3      False
4      False
       ...
886    False
887    False
888    False
889    False
890    False
Length: 891, dtype: bool

In [68]:
train_df.duplicated() == True

0      False
1      False
2      False
3      False
4      False
       ...
886    False
887    False
888    False
889    False
890    False
Length: 891, dtype: bool

In [69]:
train_df.dropna()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
10,11,1,3,"Sandstrom, Miss. Marguerite Rut",female,4.0,1,1,PP 9549,16.7000,G6,S
11,12,1,1,"Bonnell, Miss. Elizabeth",female,58.0,0,0,113783,26.5500,C103,S
...,...,...,...,...,...,...,...,...,...,...,...,...
871,872,1,1,"Beckwith, Mrs. Richard Leonard (Sallie Monypeny)",female,47.0,1,1,11751,52.5542,D35,S
872,873,0,1,"Carlsson, Mr. Frans Olof",male,33.0,0,0,695,5.0000,B51 B53 B55,S
879,880,1,1,"Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)",female,56.0,0,1,11767,83.1583,C50,C
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C

1) filling using averages
2)ffill/bfill/ interpolate

In [71]:
x = train_df['Age'].mean()

In [72]:
x

29.69911764705882

In [73]:
train_df['Age'].fillna(x)

0      22.000000
1      38.000000
2      26.000000
3      35.000000
4      35.000000
         ...
886    27.000000
887    19.000000
888    29.699118
889    26.000000
890    32.000000
Name: Age, Length: 891, dtype: float64

In [74]:
train_df['Age'].fillna(int(x))

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888    29.0
889    26.0
890    32.0
Name: Age, Length: 891, dtype: float64

In [75]:
train_df['Age'].fillna(int(x),inplace = True)

In [76]:
train_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          891 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [83]:
train_df['Cabin'].ffill(inplace = True)    #ffill -> forward fill   # used to fill missing values in a DataFrame with the previous non-missing value.
train_df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,C85,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,C123,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,C50,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,29.0,1,2,W./C. 6607,23.4500,B42,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,C148,Q

In [76]:
train_df['Cabin'].bfill(inplace = True)   #bfill -> back fill  #The bfill() method replaces the NULL values with the values from the next row (or next column, if the axis parameter is set to 'columns' ).
train_df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,C85,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,C123,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,E46,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,B42,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,29.0,1,2,W./C. 6607,23.4500,C148,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [84]:
train_df['Embarked'].interpolate(inplace = True)

In [77]:
train_df[train_df['Embarked']==None]

Empty DataFrame
Columns: [PassengerId, Survived, Pclass, Name, Sex, Age, SibSp, Parch, Ticket, Fare, Cabin, Embarked]
Index: []

In [9]:
import numpy as np
cabin_df = train_df[(train_df['Cabin']!='NaN')]
cabin_df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [87]:
train_df = train_df[train_df[['Age']].isnull()]

In [89]:
train_df['Age'].isnull()

0      True
1      True
2      True
3      True
4      True
       ...
886    True
887    True
888    True
889    True
890    True
Name: Age, Length: 891, dtype: bool

In [10]:
train_df['Embarked'].interpolate(method = 'bfill',inplace = True)

In [11]:
train_df['Embarked'].isnull().sum()

0

In [15]:
salaries_df.columns

Index(['rank', 'discipline', 'phd', 'service', 'sex', 'salary'], dtype='object')

In [98]:
mean_salary = salaries_df.groupby('rank')[['salary']].mean()

In [99]:
mean_salary

                  salary
rank
AssocProf   91786.230769
AsstProf    81362.789474
Prof       123624.804348

In [24]:
mean_salary = salaries_df.groupby('rank')[['salary']].mean()
mean_salary.sort_values(by = 'salary')

                  salary
rank
AsstProf    81362.789474
AssocProf   91786.230769
Prof       123624.804348

In [25]:
mean_salary = salaries_df.groupby('rank')[['salary']].mean()
mean_salary.sort_values(by = 'salary',ascending = False)

                  salary
rank
Prof       123624.804348
AssocProf   91786.230769
AsstProf    81362.789474

In [22]:
discipline_salary = salaries_df.groupby('discipline')[['salary']].mean()

In [23]:
discipline_salary

                   salary
discipline
A            98331.111111
B           116331.785714

In [104]:
mean_salary.sort_values(by = 'salary', ascending = False)

                  salary
rank
Prof       123624.804348
AssocProf   91786.230769
AsstProf    81362.789474

In [102]:
discipline_salary = salaries_df.groupby('discipline')[['salary']].mean()

In [103]:
discipline_salary

                   salary
discipline
A            98331.111111
B           116331.785714

In [ ]:
pd.plot()